cases/choked/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     rhoCentralFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         0.002;

deltaT          1e-8;

adjustTimeStep  yes;
maxCo           0.35;
maxDeltaT       2e-7;

writeControl    adjustableRunTime;
writeInterval   2e-4;

purgeWrite      3;

writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;
